; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v9 ?v11)
             (pred_5 ?v4 ?v5)
             (pred_1 ?v9 ?v5)
             (pred_10 ?v2 ?v9 )
	     (pred_7 ?v9)
             (pred_9 ?v8)
             (pred_8 ?v4)
             (pred_4 ?v5)
             (pred_6 ?v9)
             (pred_11 ?v4)
             (pred_12 ?v9)
             (pred_2 ))



(:action op_5
:parameters (?v13 ?v7 ?v3 ?v1)
:precondition (and (pred_9 ?v13) (pred_9 ?v7) (pred_8 ?v3) (pred_4 ?v1)
          (pred_3 ?v13 ?v7) (pred_5 ?v3 ?v1)
                   (pred_1 ?v7 ?v1) (pred_7 ?v13) 
                   (pred_6 ?v7) (pred_11 ?v3))
:effect (and  (pred_12 ?v7) (not (pred_6 ?v7))))


(:action op_4
:parameters (?v13 ?v10)
:precondition (and (pred_9 ?v13) (pred_9 ?v10)
               (pred_7 ?v13) (pred_3 ?v13 ?v10) (pred_12 ?v10))
:effect (and (pred_7 ?v10) (not (pred_7 ?v13))))

(:action op_3
:parameters (?v13 ?v3)
:precondition (and (pred_9 ?v13) (pred_8 ?v3) 
                  (pred_7 ?v13) (pred_10 ?v3 ?v13) (pred_2 ))
:effect (and (pred_11 ?v3)
   (not (pred_10 ?v3 ?v13)) (not (pred_2 ))))


(:action op_1
:parameters (?v13 ?v12 ?v6)
:precondition (and (pred_9 ?v13) (pred_8 ?v12) (pred_8 ?v6)
                  (pred_7 ?v13) (pred_11 ?v6) (pred_10 ?v12 ?v13))
:effect (and (pred_11 ?v12) (pred_10 ?v6 ?v13)
        (not (pred_11 ?v6)) (not (pred_10 ?v12 ?v13))))

(:action op_2
:parameters (?v13 ?v3)
:precondition (and (pred_9 ?v13) (pred_8 ?v3) 
                  (pred_7 ?v13) (pred_11 ?v3))
:effect (and (pred_2 ) (pred_10 ?v3 ?v13) (not (pred_11 ?v3)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_01 obj_07 obj_06 obj_20 obj_03 obj_18 obj_10 obj_14 obj_17 obj_19 obj_08 obj_12 obj_16 obj_09 obj_04 obj_13
    obj_05 obj_11
    obj_02 obj_15
    )

    (:init
       (pred_2)

       (pred_9 obj_01)
       (pred_9 obj_07)
       (pred_9 obj_06)
       (pred_9 obj_20)
       (pred_9 obj_03)
       (pred_9 obj_18)
       (pred_9 obj_10)
       (pred_9 obj_14)
       (pred_9 obj_17)
       (pred_9 obj_19)
       (pred_9 obj_08)
       (pred_9 obj_12)
       (pred_9 obj_16)
       (pred_9 obj_09)
       (pred_9 obj_04)
       (pred_9 obj_13)
       (pred_4 obj_05)
       (pred_4 obj_11)
       (pred_8 obj_02)
       (pred_8 obj_15)

       (pred_3 obj_01 obj_03)
       (pred_3 obj_01 obj_07)
       (pred_3 obj_07 obj_18)
       (pred_3 obj_07 obj_06)
       (pred_3 obj_07 obj_01)
       (pred_3 obj_06 obj_10)
       (pred_3 obj_06 obj_20)
       (pred_3 obj_06 obj_07)
       (pred_3 obj_20 obj_14)
       (pred_3 obj_20 obj_06)
       (pred_3 obj_03 obj_17)
       (pred_3 obj_03 obj_18)
       (pred_3 obj_03 obj_01)
       (pred_3 obj_18 obj_19)
       (pred_3 obj_18 obj_10)
       (pred_3 obj_18 obj_07)
       (pred_3 obj_18 obj_03)
       (pred_3 obj_10 obj_08)
       (pred_3 obj_10 obj_14)
       (pred_3 obj_10 obj_06)
       (pred_3 obj_10 obj_18)
       (pred_3 obj_14 obj_12)
       (pred_3 obj_14 obj_20)
       (pred_3 obj_14 obj_10)
       (pred_3 obj_17 obj_16)
       (pred_3 obj_17 obj_19)
       (pred_3 obj_17 obj_03)
       (pred_3 obj_19 obj_09)
       (pred_3 obj_19 obj_08)
       (pred_3 obj_19 obj_18)
       (pred_3 obj_19 obj_17)
       (pred_3 obj_08 obj_04)
       (pred_3 obj_08 obj_12)
       (pred_3 obj_08 obj_10)
       (pred_3 obj_08 obj_19)
       (pred_3 obj_12 obj_13)
       (pred_3 obj_12 obj_14)
       (pred_3 obj_12 obj_08)
       (pred_3 obj_16 obj_09)
       (pred_3 obj_16 obj_17)
       (pred_3 obj_09 obj_04)
       (pred_3 obj_09 obj_19)
       (pred_3 obj_09 obj_16)
       (pred_3 obj_04 obj_13)
       (pred_3 obj_04 obj_08)
       (pred_3 obj_04 obj_09)
       (pred_3 obj_13 obj_12)
       (pred_3 obj_13 obj_04)
       (pred_6 obj_03)
       (pred_6 obj_16)
       (pred_1  obj_03 obj_05)
       (pred_1  obj_16 obj_11)
       (pred_12 obj_01)
       (pred_12 obj_07)
       (pred_12 obj_06)
       (pred_12 obj_20)
       (pred_12 obj_18)
       (pred_12 obj_10)
       (pred_12 obj_14)
       (pred_12 obj_17)
       (pred_12 obj_19)
       (pred_12 obj_08)
       (pred_12 obj_12)
       (pred_12 obj_09)
       (pred_12 obj_04)
       (pred_12 obj_13)

       (pred_5  obj_02 obj_05)
       (pred_5  obj_15 obj_11)
       (pred_10 obj_02 obj_13)
       (pred_10 obj_15 obj_13)
       (pred_7 obj_08)
    )

    (:goal (and
       (pred_10 obj_02 obj_17)
    ))
(:constraints
  (always (not (pred_7 obj_12)))
)
)

; plan
1. (op_4 obj_08 obj_04)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_04)
   goals met: 0 of 1
2. (op_4 obj_04 obj_13)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_13)
   goals met: 0 of 1
3. (op_3 obj_13 obj_02)
   deleted: (pred_10 obj_02 obj_13) (pred_2)
   added: (pred_11 obj_02)
   goals met: 0 of 1
4. (op_4 obj_13 obj_04)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_04)
   goals met: 0 of 1
5. (op_4 obj_04 obj_08)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_08)
   goals met: 0 of 1
6. (op_4 obj_08 obj_19)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_19)
   goals met: 0 of 1
7. (op_4 obj_19 obj_17)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_17)
   goals met: 0 of 1
8. (op_2 obj_17 obj_02)
   deleted: (pred_11 obj_02)
   added: (pred_2) (pred_10 obj_02 obj_17)
   goals met: 1 of 1
